Reports/ТекучестьКадров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Report>
		<Properties>
			<Name>ТекучестьКадров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Лига</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лига</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Данные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Точка</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чемпионат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Чемпионаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Игрок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Игроки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Старики</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Новички</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ТурнирнаяТаблица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ТурнирнаяТаблица</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоГолов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОчков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Тур</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Туры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ПеремещенияИгроков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ПеремещенияИгроков</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Амплуа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Амплуа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Игрок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Игроки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Туры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Туры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Чемпионаты</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Чемпионаты</xr:Item>
				<xr:Item>Catalog.Туры</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОлимпийскаяСистема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Чемпионаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Чемпионаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Лига</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Лига</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ТекучестьКадров/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Функция ДанныеПолучить()
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 11
	                      |	Туры.Владелец КАК Чемпионат,
	                      |	Туры.Владелец.ДатаОкончания КАК ДатаОкончания
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	Справочник.Туры КАК Туры
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |		ПО Туры.Ссылка = ТурнирнаяТаблица.Тур
	                      |ГДЕ
	                      |	Туры.Владелец.Владелец = &Лига
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Туры.Владелец,
	                      |	Туры.Владелец.ДатаОкончания
	                      |
	                      |ИМЕЮЩИЕ
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) >= ЦЕЛ(0.1 * КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Команда) * (КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Команда) - 1))
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ДатаОкончания УБЫВ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ЧемпионатыКоманды.Ссылка КАК Чемпионат,
	                      |	ЧемпионатыКоманды.Ссылка.ДатаОкончания КАК Точка,
	                      |	ЧемпионатыКоманды.Команда КАК Команда,
	                      |	ДОБАВИТЬКДАТЕ(ЧемпионатыКоманды.Ссылка.ДатаНачала, МЕСЯЦ, -3) КАК ДатаНачала,
	                      |	ДОБАВИТЬКДАТЕ(ЧемпионатыКоманды.Ссылка.ДатаОкончания, МЕСЯЦ, -3) КАК ДатаОкончания
	                      |ИЗ
	                      |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	                      |ГДЕ
	                      |	ЧемпионатыКоманды.Ссылка В
	                      |			(ВЫБРАТЬ
	                      |				ВТ.Чемпионат
	                      |			ИЗ
	                      |				ВТ)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Точка
	                      |ИТОГИ
	                      |	МАКСИМУМ(Точка),
	                      |	МАКСИМУМ(ДатаНачала),
	                      |	МАКСИМУМ(ДатаОкончания)
	                      |ПО
	                      |	Чемпионат");
	Если Отчет.Данные.Количество() = 0 Тогда
		Запрос.УстановитьПараметр("Лига",		Отчет.Лига);
		Чемпионаты = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Запрос.Текст = "ВЫБРАТЬ
		               |	&Точка КАК Точка,
		               |	&Чемпионат КАК Чемпионат,
		               |	СрезПоследних.Команда КАК Команда,
		               |	МАКСИМУМ(СрезПоследних.Игрок) КАК Игрок,
		               |	СУММА(ВЫБОР
		               |			КОГДА СрезПоследних.Команда = ПеремещенияИгроков.Команда
		               |				ТОГДА 0
		               |			ИНАЧЕ 1
		               |		КОНЕЦ) КАК Новички,
		               |	СУММА(ВЫБОР
		               |			КОГДА СрезПоследних.Команда = ПеремещенияИгроков.Команда
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Старики
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		ПеремещенияИгроковСрезПоследних.Игрок КАК Игрок,
		               |		ПеремещенияИгроковСрезПоследних.Команда КАК Команда
		               |	ИЗ
		               |		РегистрСведений.ПеремещенияИгроков.СрезПоследних(&Дата, ) КАК ПеремещенияИгроковСрезПоследних
		               |	ГДЕ
		               |		ПеремещенияИгроковСрезПоследних.Команда В(&Команды)) КАК СрезПоследних
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПеремещенияИгроков.СрезПоследних(&ДатаН, ) КАК ПеремещенияИгроков
		               |		ПО СрезПоследних.Игрок = ПеремещенияИгроков.Игрок
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	СрезПоследних.Команда";
		Пока Чемпионаты.Следующий() Цикл
			мКлубы	= Новый Массив;
			Выборка	= Чемпионаты.Выбрать();
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(Отчет.Данные.Добавить(), Выборка);
				мКлубы.Добавить(Выборка.Команда);
			КонецЦикла;
			Запрос.УстановитьПараметр("ДатаН",		Чемпионаты.ДатаНачала);
			Запрос.УстановитьПараметр("Дата",		Чемпионаты.ДатаОкончания);
			Запрос.УстановитьПараметр("Точка",		Чемпионаты.Точка);
			Запрос.УстановитьПараметр("Чемпионат",	Чемпионаты.Чемпионат);
			Запрос.УстановитьПараметр("Команды",	мКлубы);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(Отчет.Данные.Добавить(), Выборка);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	Если ЗначениеЗаполнено(Отчет.Команда) Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВТ.Точка КАК Точка,
		               |	ВТ.Чемпионат КАК Чемпионат,
		               |	ВТ.Команда КАК Команда,
		               |	ВТ.Игрок КАК Игрок,
		               |	ВТ.Старики КАК Старики,
		               |	ВТ.Новички КАК Новички
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	&ВТ КАК ВТ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Точка КАК Точка,
		               |	ВТ.Чемпионат КАК Чемпионат,
		               |	МАКСИМУМ(ВТ.Игрок) КАК Игрок,
		               |	ЕСТЬNULL(ВложенныйЗапрос.Старики, 0) КАК Старики,
		               |	ЕСТЬNULL(ВложенныйЗапрос.Новички, 0) КАК Новички
		               |ИЗ
		               |	ВТ КАК ВТ
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			ВТ.Точка КАК Точка,
		               |			СУММА(ВТ.Старики) КАК Старики,
		               |			СУММА(ВТ.Новички) КАК Новички
		               |		ИЗ
		               |			ВТ КАК ВТ
		               |		ГДЕ
		               |			ВТ.Команда = &Команда
		               |		
		               |		СГРУППИРОВАТЬ ПО
		               |			ВТ.Точка) КАК ВложенныйЗапрос
		               |		ПО ВТ.Точка = ВложенныйЗапрос.Точка
		               |ГДЕ
		               |	ВТ.Команда = &Команда
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ.Точка,
		               |	ВТ.Чемпионат,
		               |	ЕСТЬNULL(ВложенныйЗапрос.Новички, 0),
		               |	ВложенныйЗапрос.Старики
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Точка";
		Запрос.УстановитьПараметр("Команда",	Отчет.Команда);
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВТ.Точка КАК Точка,
		               |	ВТ.Чемпионат КАК Чемпионат,
		               |	ВТ.Старики КАК Старики,
		               |	ВТ.Новички КАК Новички
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	&ВТ КАК ВТ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Точка КАК Точка,
		               |	ВТ.Чемпионат КАК Чемпионат,
		               |	СУММА(ВТ.Старики) КАК Старики,
		               |	СУММА(ВТ.Новички) КАК Новички
		               |ИЗ
		               |	ВТ КАК ВТ
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ.Точка,
		               |	ВТ.Чемпионат
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Точка";
	КонецЕсли;
	Запрос.УстановитьПараметр("ВТ",	Отчет.Данные.Выгрузить());
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

&НаСервере
Функция УстановитьТочку(Данные)
	Точка = График.УстановитьТочку(ФорматЧГ(Данные.Точка));
	Точка.Расшифровка = Данные.Чемпионат;
	Возврат Точка;
КонецФункции

&НаСервере
Процедура ГрафикОбновить()
	График.Очистить();
	Если НЕ ЗначениеЗаполнено(Отчет.Лига) Тогда Возврат; КонецЕсли;
	
	Старики	= График.УстановитьСерию("Старики");
	Новички	= График.УстановитьСерию("Новички");
	Если ЗначениеЗаполнено(Отчет.Команда) Тогда
		Цвет = СерверныйФункции.ЦветКоманды(Отчет.Команда);
		Если Цвет <> Неопределено Тогда
			Новички.Цвет = Цвет;
		КонецЕсли;
	КонецЕсли;
	Выборка = ДанныеПолучить();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Старики = 0 И Выборка.Новички = 0 И График.Точки.Количество() = 0 Тогда
			//
		ИначеЕсли ЗначениеЗаполнено(Отчет.Команда) Тогда
			Если Выборка.Новички = 1 Тогда
				График.УстановитьЗначение(УстановитьТочку(Выборка), Новички, Выборка.Новички, Выборка.Игрок, Выборка.Игрок);
			Иначе
				График.УстановитьЗначение(УстановитьТочку(Выборка), Новички, Выборка.Новички, Новый Структура("Дата,Команда", Выборка.Точка, Отчет.Команда));
			КонецЕсли;
			График.УстановитьЗначение(График.УстановитьТочку(ФорматЧГ(Выборка.Точка)), Старики, Выборка.Старики, Отчет.Команда);
		Иначе
			График.УстановитьЗначение(График.УстановитьТочку(ФорматЧГ(Выборка.Точка)), Старики, Выборка.Старики, Выборка.Чемпионат);
			График.УстановитьЗначение(УстановитьТочку(Выборка), Новички, Выборка.Новички, Выборка.Чемпионат);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда=Неопределено)
	Если ПроверитьЗаполнение() Тогда
		ГрафикОбновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Отчет.Лига) Тогда
		Отчет.Лига = МояЛига();
	КонецЕсли;
	Если ЗначениеЗаполнено(Отчет.Лига) Тогда
		КлубыЗагрузить();
	КонецЕсли;
	Сформировать();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Лига") Тогда
		Отчет.Лига	= Параметры.Лига;
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.Лига);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция МояЛига()
	Возврат СерверныйФункции.Лига(СерверныйФункции.ЧемпионатПолучитьПоследнее());
КонецФункции

&НаКлиенте
Процедура КартинкиЗагрузить() Экспорт
	ОбщегоНазначения.КартинкиЗагрузить(Элементы.Команда.СписокВыбора, Кеш);
КонецПроцедуры

&НаКлиенте
Процедура КлубыЗагрузить(мКоманды=Неопределено)
	Если Клубы.Количество() = 0 Или ТипЗнч(мКоманды) = Тип("Массив") Тогда
		Если мКоманды = Неопределено Тогда мКоманды = КлубыПолучить(Отчет.Лига); КонецЕсли;
		Клубы.ЗагрузитьЗначения(мКоманды);
		Элементы.Команда.СписокВыбора.ЗагрузитьЗначения(СерверныйФункции.КомандыЛиги(Отчет.Лига, Истина));
		ПодключитьОбработчикОжидания("КартинкиЗагрузить", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция КлубыПолучить(Лига)
	Запрос	= Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 11
	      	               |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат
	      	               |ПОМЕСТИТЬ Чемпионаты
	      	               |ИЗ
	      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
	      	               |		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
	      	               |ГДЕ
	      	               |	Туры.Владелец.Владелец = &Лига
	      	               |
	      	               |СГРУППИРОВАТЬ ПО
	      	               |	ТурнирнаяТаблица.Тур.Владелец,
	      	               |	Туры.Владелец.ДатаОкончания
	      	               |
	      	               |ИМЕЮЩИЕ
	      	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) >= ЦЕЛ(0.1 * КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Команда) * (КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Команда) - 1))
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Туры.Владелец.ДатаОкончания УБЫВ
	      	               |;
	      	               |
	      	               |////////////////////////////////////////////////////////////////////////////////
	      	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	      	               |	ТурнирнаяТаблица.Команда КАК Команда
	      	               |ИЗ
	      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |ГДЕ
	      	               |	ТурнирнаяТаблица.Тур.Владелец В
	      	               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	      	               |				Чемпионаты.Чемпионат
	      	               |			ИЗ
	      	               |				Чемпионаты)");
	Запрос.УстановитьПараметр("Лига",			Лига);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

&НаКлиенте
Процедура ЛигаПриИзменении(Элемент)
	Отчет.Данные.Очистить();
	Отчет.Команда = Неопределено;
	Клубы.Очистить();
	КлубыЗагрузить();
	ГрафикОбновить();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПриИзменении(Элемент)
	ГрафикОбновить();
КонецПроцедуры

&НаСервере
Функция ИгрокиПолучить(ПараметрыЗапроса)
	Если ПараметрыЗапроса = Неопределено Тогда Возврат Новый Массив; КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПеремещенияИгроковСрезПоследних.Игрок КАК Игрок
	                      |ПОМЕСТИТЬ ПеремещенияИгроковСрезПоследних
	                      |ИЗ
	                      |	РегистрСведений.ПеремещенияИгроков.СрезПоследних(&Дата, ) КАК ПеремещенияИгроковСрезПоследних
	                      |ГДЕ
	                      |	ПеремещенияИгроковСрезПоследних.Команда = &Команда
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 11
	                      |	ПеремещенияИгроковСрезПоследних.Игрок КАК Игрок
	                      |ИЗ
	                      |	ПеремещенияИгроковСрезПоследних КАК ПеремещенияИгроковСрезПоследних
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПеремещенияИгроков.СрезПоследних(&ДатаН, ) КАК ПеремещенияИгроков
	                      |		ПО ПеремещенияИгроковСрезПоследних.Игрок = ПеремещенияИгроков.Игрок
	                      |ГДЕ
	                      |	ПеремещенияИгроков.Команда <> &Команда
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Игрок
	                      |АВТОУПОРЯДОЧИВАНИЕ");
	Запрос.УстановитьПараметр("ДатаН",		ДобавитьМесяц(ПараметрыЗапроса.Дата, -15));
	Запрос.УстановитьПараметр("Дата",		ДобавитьМесяц(ПараметрыЗапроса.Дата, -3));
	Запрос.УстановитьПараметр("Команда",	ПараметрыЗапроса.Команда);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

&НаКлиенте
Процедура Показать(Данные, СтандартнаяОбработка=Ложь) Экспорт
	НаКлиенте.Показать(Данные, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ГрафикВыбор(Элемент, ЗначениеДиаграммы, СтандартнаяОбработка)
	Если ТипЗнч(ЗначениеДиаграммы.Расшифровка) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		
		Игроки = ИгрокиПолучить(ЗначениеДиаграммы.Расшифровка);
		Если Игроки.Количество() = 1 Тогда
			Показать(Игроки.Получить(0));
		Иначе
			Список = Новый СписокЗначений;
			Список.ЗагрузитьЗначения(Игроки);
			Список.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("Показать", ЭтотОбъект), "Выберите игрока");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
